# Calculating Summary Statistics In Pandas

In [9]:
import pandas as pd

In [10]:
data = pd.read_csv("C:/Users/PRAGYA GUPTA/OneDrive/Documents/MyProjects/PandasTutorial/csvFile/titanic/train.csv")

In [11]:
data.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

# What is the mean age of the Titanic passengers?

In [12]:
data['Age'].mean()

29.69911764705882

# What is the median age and ticket fare price of the Titanic passengers?

In [23]:
data[['Age','Fare']].median()

Age     28.0000
Fare    14.4542
dtype: float64

# Different Aggregates For Certain Columns

In [25]:
data[['Age','Fare']].describe()

              Age        Fare
count  714.000000  891.000000
mean    29.699118   32.204208
std     14.526497   49.693429
min      0.420000    0.000000
25%     20.125000    7.910400
50%     28.000000   14.454200
75%     38.000000   31.000000
max     80.000000  512.329200

# DataFrame.agg()

Helps in Specific combinations of aggregating statistics for given columns

In [26]:
data.agg(
    {
        "Age": ["min", "max", "median", "skew"],
        "Fare": ["min", "max", "median", "mean"],
    }
)

              Age        Fare
min      0.420000    0.000000
max     80.000000  512.329200
median  28.000000   14.454200
skew     0.389108         NaN
mean          NaN   32.204208

#                                                   Grouped By Category :

In [29]:
data.head(1)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,NaN,S

# What is the average age for male versus female Titanic passengers?

In [30]:
data[['Sex','Age']].groupby('Sex').mean()

              Age
Sex
female  27.915709
male    30.726645

                                                        OR

In [31]:
data.groupby("Sex")["Age"].mean()

Sex
female    27.915709
male      30.726645
Name: Age, dtype: float64

In [32]:
data.head(1)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,NaN,S

# What is the mean ticket fare price for each of the sex and Passenger class combinations?

In [38]:
data.groupby(['Sex','Pclass'])['Fare'].mean()

Sex     Pclass
female  1         106.125798
        2          21.970121
        3          16.118810
male    1          67.226127
        2          19.741782
        3          12.661633
Name: Fare, dtype: float64

# What is the number of passengers in each of the Passenger classes?

In [50]:
data.groupby("Pclass")["Pclass"].count()

Pclass
1    216
2    184
3    491
Name: Pclass, dtype: int64

                                                        OR

In [45]:
data["Pclass"].value_counts()

3    491
1    216
2    184
Name: Pclass, dtype: int64

The value_counts() method counts the number of records for each category in a column.

In [49]:
data.groupby(['Pclass'])['Pclass'].size()

Pclass
1    216
2    184
3    491
Name: Pclass, dtype: int64

Both size and count can be used in combination with groupby. Whereas size includes NaN values and just provides the number of rows (size of the table), count excludes the missing values. In the value_counts method, use the dropna argument to include or exclude the NaN values.

In [48]:
data.groupby(['Pclass'])['Pclass'].size()

Pclass
1    216
2    184
3    491
Name: Pclass, dtype: int64

#### ~ Pragya ðŸŽ€